einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_clkpwr.c
/* Copyright (c) 2014-2025, DF9DQ
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * Redistributions of source code must retain the above copyright notice, this list
 * of conditions and the following disclaimer.
 * Redistributions in binary form must reproduce the above copyright notice, this list
 * of conditions and the following disclaimer in the documentation and/or
 * other materials provided with the distribution.
 * Neither the name of the author nor the names of its contributors may be used
 * to endorse or promote products derived from this software without specific
 * prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/** \file
 *  \brief CLKPWR driver implementation.
 *
 *  This file contains the implementation of the CLKPWR block driver.
 */

/** \addtogroup CLKPWR
 *  @{
 */

#include "lpc54xxx_libconfig.h"


#include "lpclib_types.h"
#include "lpc54xxx_clkpwr.h"
#include "lpc54xxx_romhandler.h"


#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
#define IRC_FREQUENCY                       (12000000ul)
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
#define FRO12_FREQUENCY                     (12000000ul)
#define FROHF48_FREQUENCY                   (48000000ul)
#define FROHF96_FREQUENCY                   (96000000ul)
#endif
#define RTC_FREQUENCY                       (32768ul)


/** Structure that reflects the PWRD API table in the ROM (see User Manual).
 */
typedef struct PWRD {
    uint32_t (*set_pll) (uint32_t multiplier, uint32_t input_freq);
    uint32_t (*set_voltage) (uint32_t mode, uint32_t desired_freq);
    void (*power_mode_configure) (uint32_t mode, uint32_t peripheral);
} PWRD;



LPCLIB_DefineRegBit(SYSCON_SYSPLLCLKSEL_SEL,        0,  2);
enum {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    PLLCLKSEL_SEL_IRC = 0,
    PLLCLKSEL_SEL_CLKIN = 1,
    PLLCLKSEL_SEL_RTC = 3,
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    PLLCLKSEL_SEL_FRO12 = 0,
    PLLCLKSEL_SEL_CLKIN = 1,
    PLLCLKSEL_SEL_RTC = 3,
#endif
};

LPCLIB_DefineRegBit(SYSCON_MAINCLKSELA_SEL,         0,  2);
enum {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    MAINCLKSELA_SEL_IRC = 0,
    MAINCLKSELA_SEL_CLKIN = 1,
    MAINCLKSELA_SEL_WDT = 2,
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    MAINCLKSELA_SEL_FRO12 = 0,
    MAINCLKSELA_SEL_CLKIN = 1,
    MAINCLKSELA_SEL_WDT = 2,
    MAINCLKSELA_SEL_FROHF = 3,
#endif
};
LPCLIB_DefineRegBit(SYSCON_MAINCLKSELB_SEL,         0,  2);
enum {
    MAINCLKSELB_SEL_MAINCLKSELA = 0,
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    MAINCLKSELB_SEL_PLLIN = 1,
#endif
    MAINCLKSELB_SEL_PLLOUT = 2,
    MAINCLKSELB_SEL_RTC = 3,
};


#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
LPCLIB_DefineRegBit(SYSCON_SYSTCKCAL_CAL,           0, 24);
LPCLIB_DefineRegBit(SYSCON_SYSTCKCAL_SKEW,          24, 1);
LPCLIB_DefineRegBit(SYSCON_SYSTCKCAL_NOREF,         25, 1);

LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_IRC_OSC,   3,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_IRC,       4,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_FLASH,     5,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_BOD_RST,   7,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_BOD_INTR,  8,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_ADC0,      10, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAM0A,    13, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAM0N,    14, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAM1,     15, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAM2,     16, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_ROM,       17, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_VDDA,      19, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_WDT_OSC,   20, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SYS_PLL,   22, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_VREFP,     23, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_32K_OSC,   24, 1);

LPCLIB_DefineRegBit(SYSCON_AHBCLKDIV_DIV,           0,  8);
#endif

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
LPCLIB_DefineRegBit(SYSCON_SYSTCKCAL_CAL,           0, 24);
LPCLIB_DefineRegBit(SYSCON_SYSTCKCAL_SKEW,          24, 1);
LPCLIB_DefineRegBit(SYSCON_SYSTCKCAL_NOREF,         25, 1);

LPCLIB_DefineRegBit(SYSCON_PRESETCTRL0_FLASH_RST,   7,  1);

LPCLIB_DefineRegBit(SYSCON_AHBCLKCTRL0_ROM,         1,  1);
LPCLIB_DefineRegBit(SYSCON_AHBCLKCTRL0_SRAM1,       3,  1);
LPCLIB_DefineRegBit(SYSCON_AHBCLKCTRL0_SRAM2,       4,  1);
LPCLIB_DefineRegBit(SYSCON_AHBCLKCTRL0_FLASH,       7,  1);

LPCLIB_DefineRegBit(SYSCON_AHBCLKDIV_DIV,           0,  8);

LPCLIB_DefineRegBit(SYSCON_FLASHCFG_FETCHCFG,       0,  2);
LPCLIB_DefineRegBit(SYSCON_FLASHCFG_DATACFG,        2,  2);
LPCLIB_DefineRegBit(SYSCON_FLASHCFG_ACCEL,          4,  1);
LPCLIB_DefineRegBit(SYSCON_FLASHCFG_PREFEN,         5,  1);
LPCLIB_DefineRegBit(SYSCON_FLASHCFG_PREFOVR,        6,  1);
LPCLIB_DefineRegBit(SYSCON_FLASHCFG_FLASHTIM,       12, 4);

LPCLIB_DefineRegBit(SYSCON_FROCTRL_SEL,             14, 1);

LPCLIB_DefineRegBit(SYSCON_SYSPLLSTAT_LOCK,         0,  1);

LPCLIB_DefineRegBit(SYSCON_SYSPLLNDEC_NDEC,         0,  10);
LPCLIB_DefineRegBit(SYSCON_SYSPLLNDEC_NREQ,         10, 1);

LPCLIB_DefineRegBit(SYSCON_SYSPLLPDEC_PDEC,         0,  7);
LPCLIB_DefineRegBit(SYSCON_SYSPLLPDEC_PREQ,         7,  1);

LPCLIB_DefineRegBit(SYSCON_SYSPLLSSCTRL0_MDEC,      0,  17);
LPCLIB_DefineRegBit(SYSCON_SYSPLLSSCTRL0_MREQ,      17, 1);
LPCLIB_DefineRegBit(SYSCON_SYSPLLSSCTRL0_SEL_EXT,   18, 1);

