einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_clkpwr.c
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_1,         1,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_3,         3,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_FRO,       4,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_FLASH,     5,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_TS,        6,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_BOD_RST,   7,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_BOD_INTR,  8,  1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_ADC0,      10, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAM0,     13, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAM1,     14, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAM2,     15, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SRAMX,     16, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_ROM,       17, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_18,        18, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_VDDA,      19, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_WDT_OSC,   20, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_USB_PHY,   21, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_SYS_PLL,   22, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_VREFP,     23, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_32K_OSC,   24, 1);
LPCLIB_DefineRegBit(SYSCON_PDRUNCFG_PDEN_26,        26, 1);
#endif


#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
/* Flash wait states lookup. Index is ((system_clock_Hz - 1) / 12 MHz) */
static const uint8_t _clkpwrFlashWaitStates[9] = {0,1,2,2,3,3,4,5,5};
#endif


/** Watchdog oscillator frequency [Hz] (as accurate as we can get it...) */
uint32_t clkpwrWdoFrequency;


/** \addtogroup CLKPWR_Public_Functions
 *  @{
 */


/* Set a clock divider. */
//TODO
LPCLIB_Result CLKPWR_setDivider (CLKPWR_Divider divider, uint32_t value)
{
    __IO uint32_t * const pSyscon = (__IO uint32_t *)LPC_SYSCON_BASE;

    pSyscon[divider] = value;

    return LPCLIB_SUCCESS;
}



#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
static const CLKPWR_Clock _CLKPWR_mainClkselA[4] = {
        CLKPWR_CLOCK_IRC,
        CLKPWR_CLOCK_CLKIN,
        CLKPWR_CLOCK_WDT,
        _CLKPWR_CLOCK_NONE,
        };
static const CLKPWR_Clock _CLKPWR_mainClkselB[4] = {
        _CLKPWR_CLOCK_MAINCLKSELA,
        CLKPWR_CLOCK_SYSTEMPLLIN,
        CLKPWR_CLOCK_SYSTEMPLL,
        CLKPWR_CLOCK_RTC,
        };
static const CLKPWR_Clock _CLKPWR_asyncClkselA[4] = {
        CLKPWR_CLOCK_IRC,
        CLKPWR_CLOCK_WDT,
        _CLKPWR_CLOCK_NONE,
        _CLKPWR_CLOCK_NONE,
        };
static const CLKPWR_Clock _CLKPWR_asyncClkselB[4] = {
        CLKPWR_CLOCK_MAIN,
        CLKPWR_CLOCK_CLKIN,
        CLKPWR_CLOCK_SYSTEMPLL,
        _CLKPWR_CLOCK_ASYNCCLKSELA,
        };
static const CLKPWR_Clock _CLKPWR_syspllClksel[4] = {
        CLKPWR_CLOCK_IRC,
        CLKPWR_CLOCK_CLKIN,
        _CLKPWR_CLOCK_NONE,
        CLKPWR_CLOCK_RTC,
        };
#endif


#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
static const CLKPWR_Clock _CLKPWR_mainClkselA[4] = {
        CLKPWR_CLOCK_FRO12,
        CLKPWR_CLOCK_CLKIN,
        CLKPWR_CLOCK_WDT,
        CLKPWR_CLOCK_FROHF,
        };
static const CLKPWR_Clock _CLKPWR_mainClkselB[4] = {
        _CLKPWR_CLOCK_MAINCLKSELA,
        _CLKPWR_CLOCK_NONE,
        CLKPWR_CLOCK_SYSTEMPLL,
        CLKPWR_CLOCK_RTC,
        };
static const CLKPWR_Clock _CLKPWR_asyncClkselA[4] = {
        CLKPWR_CLOCK_MAIN,
        CLKPWR_CLOCK_FRO12,
        _CLKPWR_CLOCK_NONE,
        _CLKPWR_CLOCK_NONE,
        };
static const CLKPWR_Clock _CLKPWR_fClkSel[8] = {
        CLKPWR_CLOCK_FRO12,
        CLKPWR_CLOCK_FROHF,
        CLKPWR_CLOCK_SYSTEMPLL,
        CLKPWR_CLOCK_MCLK,
        CLKPWR_CLOCK_FRG,
        _CLKPWR_CLOCK_NONE,
        _CLKPWR_CLOCK_NONE,
        _CLKPWR_CLOCK_NONE,
        };
static const CLKPWR_Clock _CLKPWR_syspllClksel[8] = {
        CLKPWR_CLOCK_FRO12,
        CLKPWR_CLOCK_CLKIN,
        _CLKPWR_CLOCK_NONE,
        CLKPWR_CLOCK_RTC,
        _CLKPWR_CLOCK_NONE,
        _CLKPWR_CLOCK_NONE,
        _CLKPWR_CLOCK_NONE,
        _CLKPWR_CLOCK_NONE,
        };
#endif

/** Return the clock frequency (in Hz) of an internal bus.
 *
 *  \param[in] bus The bus to be queried
 */
uint32_t CLKPWR_getBusClock (CLKPWR_Clock clock)
{
//TODO Check if async clock is on!
    switch (clock) {
        /* Virtual clocks */
        case _CLKPWR_CLOCK_MAINCLKSELA:
            return CLKPWR_getBusClock(_CLKPWR_mainClkselA[LPC_SYSCON->MAINCLKSELA & 3]);
        case _CLKPWR_CLOCK_ASYNCCLKSELA:
            return CLKPWR_getBusClock(_CLKPWR_asyncClkselA[LPC_ASYNCSYSCON->ASYNCAPBCLKSELA & 3]);

        /* Base clocks */
        case CLKPWR_CLOCK_RTC:
            return RTC_FREQUENCY;
        case CLKPWR_CLOCK_CLKIN:
            //TODO
            return 0;
        case CLKPWR_CLOCK_SYSTEMPLLIN:
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
            return CLKPWR_getBusClock(_CLKPWR_syspllClksel[LPC_SYSCON->SYSPLLCLKSEL & 3]);
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
            return CLKPWR_getBusClock(_CLKPWR_syspllClksel[LPC_SYSCON->SYSPLLCLKSEL & 7]);
#endif
        case CLKPWR_CLOCK_SYSTEMPLL:
            //TODO
return 48000000;

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
        case CLKPWR_CLOCK_IRC:
            return IRC_FREQUENCY;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
        case CLKPWR_CLOCK_FRO12:
            return FRO12_FREQUENCY;
        case CLKPWR_CLOCK_FROHF:
            return LPC_SYSCON->FROCTRL & SYSCON_FROCTRL_SEL_Msk ? FROHF96_FREQUENCY : FROHF48_FREQUENCY;
#endif
            return 0;

        /* Branch clocks */
        case CLKPWR_CLOCK_MAIN:
            return CLKPWR_getBusClock(_CLKPWR_mainClkselB[LPC_SYSCON->MAINCLKSELB & 3]);
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
        case CLKPWR_CLOCK_CPU:
            return CLKPWR_getBusClock(CLKPWR_CLOCK_MAIN)
                    / ((LPC_SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_Msk) >> SYSCON_AHBCLKDIV_DIV_Pos);
        case CLKPWR_CLOCK_ASYNCAPB:
            return CLKPWR_getBusClock(_CLKPWR_asyncClkselB[LPC_ASYNCSYSCON->ASYNCAPBCLKSELB & 3]);
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
        case CLKPWR_CLOCK_CPU:
            return CLKPWR_getBusClock(CLKPWR_CLOCK_MAIN)
                    / (((LPC_SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_Msk) >> SYSCON_AHBCLKDIV_DIV_Pos) + 1);
        case CLKPWR_CLOCK_ASYNCAPB:
            return CLKPWR_getBusClock(_CLKPWR_CLOCK_ASYNCCLKSELA);
        case CLKPWR_CLOCK_FLEXCOMM0:
        case CLKPWR_CLOCK_FLEXCOMM1:
        case CLKPWR_CLOCK_FLEXCOMM2:
        case CLKPWR_CLOCK_FLEXCOMM3:
        case CLKPWR_CLOCK_FLEXCOMM4:
        case CLKPWR_CLOCK_FLEXCOMM5:
        case CLKPWR_CLOCK_FLEXCOMM6:
        case CLKPWR_CLOCK_FLEXCOMM7:
            return CLKPWR_getBusClock(_CLKPWR_fClkSel[LPC_SYSCON->FCLKSEL[clock - CLKPWR_CLOCK_FLEXCOMM0] & 7]);
#endif

        default:
            return 0;
    }
}



/** Attempts to set the CPU clock to the desired frequency.
 *
 *  Sets the CPU clock to the frequency which is closest to the requested
 *  value. Assumes that the PLL input clock has been selected before.
 *
 *  \param[in] targetCpuFrequency Desired CPU frequency (Hz)
 *  \return ...
 */
LPCLIB_Result CLKPWR_setCpuClock (uint32_t targetCpuFrequency, CLKPWR_Clock fundamentalClock)
{
    uint32_t inputFrequency;


    /* If core clock is yet unknown, set it to IRC frequency (reset state). */
    if (SystemCoreClock == 0) {
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
        SystemCoreClock = FRO12_FREQUENCY;
#else
        SystemCoreClock = IRC_FREQUENCY;
#endif
    }

    /* Don't change anything if frequency doesn't change. */
    if (SystemCoreClock == targetCpuFrequency) {
        return LPCLIB_SUCCESS;
    }

