einergehtnochrein/ra-firmware/lpc54000/src/lpc54xxx_clkpwr.c
    /* Select IRC clock before manipulating PLL */
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    LPC_SYSCON->MAINCLKSELB = (MAINCLKSELB_SEL_PLLIN << SYSCON_MAINCLKSELB_SEL_Pos);
    LPC_SYSCON->MAINCLKSELA = (MAINCLKSELA_SEL_IRC << SYSCON_MAINCLKSELA_SEL_Pos);
    LPC_SYSCON->MAINCLKSELB = (MAINCLKSELB_SEL_MAINCLKSELA << SYSCON_MAINCLKSELB_SEL_Pos);
    LPC_SYSCON->AHBCLKDIV = 1;                          /* CPU clock = main clock */
    SystemCoreClock = IRC_FREQUENCY;
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    LPC_SYSCON->MAINCLKSELA = (MAINCLKSELA_SEL_FRO12 << SYSCON_MAINCLKSELA_SEL_Pos);
    LPC_SYSCON->MAINCLKSELB = (MAINCLKSELB_SEL_MAINCLKSELA << SYSCON_MAINCLKSELB_SEL_Pos);
    LPC_SYSCON->AHBCLKDIV = 0;                          /* CPU clock = main clock */
    SystemCoreClock = FRO12_FREQUENCY;
#endif

    /* Disable PLL and set its input clock to the specified fundamental clock */
    bool syspllClkOk = true;
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    LPC_SYSCON->PDRUNCFGSET = SYSCON_PDRUNCFG_PDEN_SYS_PLL_Msk;
    switch (fundamentalClock) {
        case CLKPWR_CLOCK_IRC:
            LPC_SYSCON->SYSPLLCLKSEL = 0;
            break;
        case CLKPWR_CLOCK_CLKIN:
            LPC_SYSCON->SYSPLLCLKSEL = 1;
            break;
        case CLKPWR_CLOCK_RTC:
            LPC_SYSCON->SYSPLLCLKSEL = 3;
            break;
        default:
            LPC_SYSCON->SYSPLLCLKSEL = 2;
            syspllClkOk = false;
            break;
    }
#endif
#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    LPC_SYSCON->PDRUNCFGSET0 = SYSCON_PDRUNCFG_PDEN_SYS_PLL_Msk;
    switch (fundamentalClock) {
        case CLKPWR_CLOCK_FRO12:
            LPC_SYSCON->SYSPLLCLKSEL = 0;
            break;
        case CLKPWR_CLOCK_CLKIN:
            LPC_SYSCON->SYSPLLCLKSEL = 1;
            break;
        case CLKPWR_CLOCK_RTC:
            LPC_SYSCON->SYSPLLCLKSEL = 3;
            break;
        default:
            LPC_SYSCON->SYSPLLCLKSEL = 7;
            syspllClkOk = false;
            break;
    }
#endif

    /* Get value of input frequency */
    inputFrequency = CLKPWR_getBusClock(fundamentalClock);

if((inputFrequency==targetCpuFrequency)||!syspllClkOk){
    SystemCoreClock=targetCpuFrequency;
    return LPCLIB_SUCCESS;
}

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5410X
    /* Call Power Profiles clocking routines */
    if (pRom->pPwrd->set_voltage(0, targetCpuFrequency) != ROM_ERR_SUCCESS) {
        return LPCLIB_ERROR;
    }
    if (pRom->pPwrd->set_pll(targetCpuFrequency / inputFrequency, inputFrequency) != ROM_ERR_SUCCESS) {
        return LPCLIB_ERROR;
    }

    LPC_SYSCON->MAINCLKSELB =                           /* Switch main clock to PLL */
        (MAINCLKSELB_SEL_PLLOUT << SYSCON_MAINCLKSELB_SEL_Pos);
    SystemCoreClock = CLKPWR_getBusClock(CLKPWR_CLOCK_MAIN) / LPC_SYSCON->AHBCLKDIV;
#endif

#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
    /* NOTE:
     * Increase VD1 from 0.9V to 1.0V when running faster than 12 MHz.
     * A few devices are failing @ 48 MHz when running with the default 0.9V.
     * There's a small increase in active power consumption.
     */
    if (targetCpuFrequency <= 12000000ul) {
        LPC_SYSCONEXTRA->VDCTRL[0] = 5;
    }
    else {
        LPC_SYSCONEXTRA->VDCTRL[0] = 7;
    }

if(targetCpuFrequency==48000000){
    // P=1 -> Fcco=96 MHz
    // N=2 -> Fref=6 MHz
    // Meff=2*8
    uint32_t x;
    int val;
    uint32_t N = 2;
    uint32_t Meff = 16;
    uint32_t M = Meff / 2;
    uint32_t P = 1;
(void)inputFrequency; //TODO

    /* NDEC, see UM 1.8, 6.5.49.6.1 */
    switch (N) {
        case 1:
            x = 0x302;
            break;
        case 2:
            x = 0x202;
            break;
        default:
            x = 0x80;
            for (val = N; val <= 256; val++) {
                x = (((x ^ (x >> 2) ^ (x >> 3) ^ (x >> 4)) & 1) << 7) | ((x >> 1) & 0x7F);
            }
            break;
    }
    LPC_SYSCON->SYSPLLNDEC = x | (1u << SYSCON_SYSPLLNDEC_NREQ_Pos);

    /* MDEC, see UM 1.8, 6.5.49.6.2 */
    switch (M) {
        case 1:
            x = 0x18003;
            break;
        case 2:
            x = 0x10003;
            break;
        default:
            x = 0x4000;
            for (val = M; val <= 32768; val++) {
                x = (((x ^ (x >> 1)) & 1) << 14) | ((x >> 1) & 0x3FFF);
            }
            break;
    }
    LPC_SYSCON->SYSPLLSSCTRL0 = 0
        | x
        | (1u << SYSCON_SYSPLLSSCTRL0_MREQ_Pos)
        | (1u << SYSCON_SYSPLLSSCTRL0_SEL_EXT_Pos)
        ;

    /* PDEC, see UM 1.8, 6.5.49.6.3 */
    switch (P) {
        case 1:
            x = 0x62;
            break;
        case 2:
            x = 0x42;
            break;
        default:
            x = 0x10;
            for (val = P; val <= 32; val++) {
                x = (((x ^ (x >> 2)) & 1) << 4) | ((x >> 1) & 0xF);
            }
            break;
    }
    LPC_SYSCON->SYSPLLPDEC = x | (1u << SYSCON_SYSPLLPDEC_PREQ_Pos);

    uint32_t selp, seli, selr;
    selp = 30;
    seli = 63;
selp = 5;
seli = 12;
    selr = 0;
    LPC_SYSCON->SYSPLLCTRL = 0
                | (selr << 0)
                | (seli << 4)
                | (selp << 10)
                | (1u << 18)
                ;

    LPC_SYSCON->PDRUNCFGCLR0 = SYSCON_PDRUNCFG_PDEN_SYS_PLL_Msk;
    while (!(LPC_SYSCON->SYSPLLSTAT & SYSCON_SYSPLLSTAT_LOCK_Msk))
        ;

    /* Set flash wait states for 48 MHz operation */
    LPC_SYSCON->FLASHCFG = (LPC_SYSCON->FLASHCFG & ~SYSCON_FLASHCFG_FLASHTIM_Msk)
        | (_clkpwrFlashWaitStates[(targetCpuFrequency - 1) / 12000000ul] << SYSCON_FLASHCFG_FLASHTIM_Pos);

    LPC_SYSCON->MAINCLKSELB =                           /* Switch main clock to PLL */
        (MAINCLKSELB_SEL_PLLOUT << SYSCON_MAINCLKSELB_SEL_Pos);

    uint32_t ahbDivider = 1 + ((LPC_SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_Msk) >> SYSCON_AHBCLKDIV_DIV_Pos);
    SystemCoreClock = CLKPWR_getBusClock(CLKPWR_CLOCK_MAIN) / ahbDivider;
}
#endif

    /* Update SysTick calibration register */
    LPC_SYSCON->SYSTCKCAL = 0
            | (((SystemCoreClock / 100) << SYSCON_SYSTCKCAL_CAL_Pos) & SYSCON_SYSTCKCAL_CAL_Msk)
            | (0 << SYSCON_SYSTCKCAL_SKEW_Pos)
            | (0 << SYSCON_SYSTCKCAL_NOREF_Pos)
            ;

    return LPCLIB_SUCCESS;
}


#if LPCLIB_FAMILY == LPCLIB_FAMILY_LPC5411X
/* Enter deep sleep mode. This function runs in SRAM0. */
void _CLKPWR_enterDeepSleep (uint32_t userPeripheralEnable);
__SECTION("LPCLIB_RAMCODE")
void _CLKPWR_enterDeepSleep (uint32_t userPeripheralEnable)
{
    uint32_t oldRUNCFG;
    uint32_t oldAHBClocks0 = LPC_SYSCON->AHBCLKCTRL0;

